[{"title":"Rise of Far-Right Populism in France Threatens Culture Across Europe, While U.K. Potentially Sets Opposite Course","description":"Europe is in a flux. Two sets of elections taking place within days of each other could see two of the continent’s most powerful countries — both with influential entertainment industries — head in opposite directions. In the U.K., the Labour Party is expected to claim a landslide victory, shifting the country to the left […]","link":"https://www.msn.com/en-us/news/world/rise-of-far-right-populism-in-france-threatens-culture-across-europe-while-u-k-potentially-sets-opposite-course/ar-BB1po3XB","publishDate":"2024-07-04T07:00:00Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1po3Xb.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"‘Sound of Hope: The Story of Possum Trot' Review: Inspirational Drama Looks to Faith as a Healing Force for Foster Care","description":"The East Texas town of Possum Trot received national notice in 2008 when ABC News, followed by \"Oprah\" and a slew of television shows that knew a heart-warmer when they saw it, sang the deserved praises of Rev. W.C. Martin and Donna Martin. The couple are the real-life basis of the faith-infused drama \"Sound of […]","link":"https://www.msn.com/en-us/movies/reviews/sound-of-hope-the-story-of-possum-trot-review-inspirational-drama-looks-to-faith-as-a-healing-force-for-foster-care/ar-BB1po1Wn","publishDate":"2024-07-04T07:00:00Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1pob7Y.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"The Flying Meat Inflation Act of 2023 Super Sale","description":"Inflation has been getting me down lately, and I know it has for a lot of other folks as well. So, after a quick staff meeting* and unanimous vote, it has been decided to shave $10 USD off Acorn and Retrobatch's price for a little while. That's like, 25% off for Acorn! How long will this sale go on? I'm not sure yet, but I'll be sure to call another hands on meeting should any more important decisions need to be made. * Flying Meat is still just me, with a little help from Kirstin now and again.","link":"http://flyingmeat.com/blog/archives/2023/1/the_flying_meat_inflation_act_of_2023_super_sale.html","publishDate":"2023-01-30T21:21:43Z","guid":"http://flyingmeat.com/blog/archives/2023/1/the_flying_meat_inflation_act_of_2023_super_sale.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Damon Lindelof Calls on Democratic Donors to 'Dembargo' Until Joe Biden Drops Out of the Presidential Race","description":"In a column for Deadline published Wednesday morning, \"Lost\" and \"Watchmen\" showrunner Damon Lindelof, who is also a major longtime donor to the Democratic Party, called for a total cessation of contributions unless Joe Biden steps down as the party's presidential nominee. \"I propose a DEMbargo. No checks written. No ActBlue links clicked. For anyone,\" Lindelof wrote. The column, comes just over a week after Biden's disastrous debate appearance...","link":"https://www.msn.com/en-us/entertainment/news/damon-lindelof-calls-on-democratic-donors-to-dembargo-until-joe-biden-drops-out-of-the-presidential-race/ar-BB1pnU2O","publishDate":"2024-07-04T06:18:08Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1hwul6.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Family of 61-Year-Old Woman Mauled to Death By Two Dogs Says She ‘Fought Until She Couldn’t Fight No More’","description":"\"Despite her brave efforts to defend herself, she did not survive the brutal attack,\" a GoFundMe created by Theresa Rhodes' sister explains","link":"https://www.msn.com/en-us/news/us/family-of-61-year-old-woman-mauled-to-death-by-two-dogs-says-she-fought-until-she-couldn-t-fight-no-more/ar-BB1pnPxs","publishDate":"2024-07-04T04:45:51Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1pnCfb.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Judge temporarily blocks Biden administration's restoration of transgender health protections","description":"A federal district court judge has temporarily halted parts of a nondiscrimination rule that would have kept insurers and medical professionals from denying hormone therapy, gender transition surgeries and similar medical care for transgender people","link":"https://abcnews.go.com/US/wireStory/judge-temporarily-blocks-biden-administrations-restoration-transgender-health-111660154","publishDate":"Wed, 03 Jul 2024 18:54:00 -0400","guid":"https://abcnews.go.com/US/wireStory/judge-temporarily-blocks-biden-administrations-restoration-transgender-health-111660154","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Acorn 7.4 Is Out","description":"A new update to Acorn is out, version 7.4. I've added clone tool improvements, you can now assign a corner radius to bézier curves and star shapes, the color picker now allows you to use float values for the RGB values (so you can get super, super accurate with your colors), and some new command bar actions and AppleScript abilities. There's more as usual, and you can check the full release notes for the details. While working on Acorn 7.4 I kept on glancing at the version number and wondering why it felt so… familiar and right to me? And then it eventually hit me — I was born in '74. So I really like this version for that reason alone. I think any future big features will be stuffed under the 7.4.x number instead of a 7.5, just so I can keep the '74 around longer. I mean, why not? It's my app and I can do that.","link":"http://flyingmeat.com/blog/archives/2023/4/acorn_7.4_is_out.html","publishDate":"2023-04-28T17:36:30Z","guid":"http://flyingmeat.com/blog/archives/2023/4/acorn_7.4_is_out.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Acorn 7.4.4 Released","description":"Acorn 7.4.4 is out, and it's a free update for anyone with an Acorn 7 license. As previously mentioned, I'm not incrementing Acorn past the 7.4 number ('74 was a good year for me). But that doesn't mean I'm not adding new features, and this release has some. Here are some highlights straight from the release notes: Super Resolution ML resizing. This new option in the Image ▸ Resize Image… menu item lets you increase the size of your image up to 4x using Machine Learning. Or is it AI now? I don't know and don't care, but it's pretty awesome! It packs a ton of crazy statistics and math into a simple little dropdown menu. Give it a shot for your photos, you won't be disappointed. (Super Resolution is for MacOS 12 or later only). Stroke Selections! Finally. You can now perform this long requested feature via the Select menu, and even works with Magic Wand selections (MacOS 11 or later only). Change your stroke size, blending, anti-alias or not, and even add a fill. You can now convert Magic Wand selections to shape layers. This is also super awesome! If you've got a fun outline of something that you want to convert into a shape, this is the way. (MacOS 11 or later only). New \"Simple Film Grain\" filter, which will add a grainy overlay to your image. Just like Grandpa's photos used to have. Other Interesting things: The Text Palette now shows what the font looks like in the font pop-up menus. Holding down the backslash key ('') will temporarily switch off any layer filters you have on selected layers. The tool palette will now dim tools that you can't use in modal operations (such as when cropping, scaling and rotating, and similar operations). Neat new trick with the Shortcuts Crop action: If you choose \"Custom\" as the position and put in negative values, the canvas will expand instead of shrink. A negative X value will increase the size on the left, Y on the bottom, Width on the right, and Height for the top. Various little improvements to the File Info window, including shortcuts (Command 1-4) to switch between the sections. Double clicking on a non-bézier shape with the anchor select tool will now convert it to a bézier shape (previously this only worked with the move tool (shortcut key 'v'). A new Shortcuts action to open images in Acorn. Various improvements to Acorn's SVG importer. The AppleScript command do filter name \"Your Filter Preset Name Here\" will now work with filter presets as well. This is in addition to the call filter preset with name command. There is a story behind this. It isn't very good. And of course, I have squashed some bugs as well, and you can read about those in the full release notes. Retrobatch has been getting most of my attention lately (the upcoming 2.1 release includes LUT support!) but working on Acorn always brings joy, and I have lots more fun things planned for in the future.","link":"http://flyingmeat.com/blog/archives/2024/2/acorn_7.4.4_released.html","publishDate":"2024-02-22T18:29:41Z","guid":"http://flyingmeat.com/blog/archives/2024/2/acorn_7.4.4_released.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Jack Osbourne recalls partying at 16 with Joshua Jackson during “Dawson's Creek” cameo: 'Lived it up!'","description":"The reality star played himself months before getting sober.","link":"https://www.msn.com/en-us/tv/news/jack-osbourne-recalls-partying-at-16-with-joshua-jackson-during-dawson-s-creek-cameo-lived-it-up/ar-BB1pnXgI","publishDate":"2024-07-04T05:31:37Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1pnJhq.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Sean Combs Under Federal Federal Grand Jury Investigation in New York | Report","description":"Sean \"Diddy\" Combs is the subject of a new federal investigation in the southern district of New York, NBC reported Wednesday. Investigators are presenting their findings to a federal grand jury, though no charges are imminent, according to the network. The nature of the investigation is unknown, but according to NBC, Combs is not at the moment a specific target; as a subject he is considered within the scope of the investigation in some...","link":"https://www.msn.com/en-us/entertainment/entertainment-celebrity/sean-combs-under-federal-federal-grand-jury-investigation-in-new-york-report/ar-BB1pnG5J","publishDate":"2024-07-04T04:35:06Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1mDruU.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Lauren Sánchez Beams as Son Nikko Walks Dolce & Gabbana Runway","description":"The philanthropist shared her \"proud mom\" moment on social media","link":"https://www.msn.com/en-us/lifestyle/lifestyle-buzz/lauren-sánchez-beams-as-son-nikko-walks-dolce-gabbana-runway/ar-BB1pnun2","publishDate":"2024-07-04T04:24:28Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1pnBWF.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Flight to New Hampshire diverted after man exposes himself, federal officials say","description":"Officials say a flight to Manchester, New Hampshire was diverted to Buffalo, New York, after a man allegedly exposed himself and urinated in the aisle of the airplane","link":"https://abcnews.go.com/US/wireStory/flight-new-hampshire-diverted-after-man-exposes-federal-111663091","publishDate":"Wed, 03 Jul 2024 22:14:23 -0400","guid":"https://abcnews.go.com/US/wireStory/flight-new-hampshire-diverted-after-man-exposes-federal-111663091","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Federal judge sentences 4 anti-abortion activists for a 2021 Tennessee clinic blockade","description":"Four anti-abortion activists who were convicted for their roles in a 2021 Tennessee clinic blockade will serve sentences ranging from six months in prison to three years of supervised release","link":"https://abcnews.go.com/US/wireStory/federal-judge-sentences-4-anti-abortion-activists-2021-111661471","publishDate":"Wed, 03 Jul 2024 19:10:14 -0400","guid":"https://abcnews.go.com/US/wireStory/federal-judge-sentences-4-anti-abortion-activists-2021-111661471","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Quick Tip for Stroking Selections in Acorn 7","description":"This came up today in response to a support question, and it's a neat trick that I think more folks should know about: In Acorn 7 you can use the Selection ▸ Make Shape from Selection menu item to convert the current selection into a shape, which you can then add a stroke to, or fill, or do whatever you want. You can even add or subtract from the selection using the various keyboard modifiers and make complex shapes from it. The one exception to this is that it won't work with the bitmap selection tools like magic wand, quick mask, and \"Make Selection from Layer\". (That'll destroy the fancy math Acorn uses to keep the selection vectors in memory). Have fun!","link":"http://flyingmeat.com/blog/archives/2023/5/quick_tip_for_stroking_selections.html","publishDate":"2023-05-02T17:02:28Z","guid":"http://flyingmeat.com/blog/archives/2023/5/quick_tip_for_stroking_selections.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Acorn 7.4.2 Is Out","description":"gus@srv:~/Projects/acorn7/.\n$ ./bin/pxbuild.sh -e 7.4.2 That's how a new build of Acorn gets pushed up (mostly). Which means Acorn 7.4.2 is out and available via the Acorn ▸ Check for Updates… menu item, or your local Mac App Store. And I'm feeling slightly lazy so I'm just going to copy and paste the release notes for you: # New Screenshot Stuff. Delayed layered screenshot: Hold down the option key when choosing the Image ▸ New Image from Layered Screenshot menu item and Acorn will wait an extra 10 seconds before taking the screenshot. This is awesome if you want to quickly switch to another app and open up a menu item. New Shortcuts action to take screenshots. Layered or not, with or without shadows, only for a certain app, and even with a little delay. MacOS 11+ only. New AppleScript command \"screenshot\" which you can use to take a layered screenshot, with various options including an option to only capture a specific app. Here's an example: tell application \"Acorn\" to screenshot app \"Mail\" delay 4 with layers and hiding shadows. You can also use \"bundle identifier\" instead of \"app\" to target a specific app name. # Fixes and Other Stuff Pertaining to the Clone Tool. New option \"Hide clone source widget\" in the palette, which does exactly what it says on the tin. Pressing the shift key now shows the correct stamp preview. Other little tweaks, such as updating the hint text correctly. # More Fixes Fixed a problem where the quick mask tool wouldn't work correctly on M1 & M2 Macs with a 64 bit image. Fixed a redraw problem when entering full screen when the grid was showing (and you had \"Super scrollable canvas\" turned off). Fixed a problem where the perspective transform tool wouldn't give a correct preview. Next up: Acorn 7.4.3 obviously. (And don't worry Retrobatch folks - I've got stuff coming for you as well).","link":"http://flyingmeat.com/blog/archives/2023/5/acorn_7.4.2_is_out.html","publishDate":"2023-05-08T21:03:41Z","guid":"http://flyingmeat.com/blog/archives/2023/5/acorn_7.4.2_is_out.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Shohei Ohtani joins Aaron Judge among starters in MLB All-Star Game, the only holdovers from last year's lineups","description":"Shohei Ohtani joins Aaron Judge among starters in MLB All-Star Game, the only holdovers from last year's lineups","link":"https://abcnews.go.com/US/wireStory/shohei-ohtani-joins-aaron-judge-starters-mlb-star-111662832","publishDate":"Wed, 03 Jul 2024 20:13:49 -0400","guid":"https://abcnews.go.com/US/wireStory/shohei-ohtani-joins-aaron-judge-starters-mlb-star-111662832","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Retrobatch 2.1","description":"Retrobatch 2.1 is out, and it's a free update for 2.x license holders. Here's what is new and awesome: A new Look up Table (LUT) node! (This is my favorite). The LUT node can be used to quickly and easily alter the color and tone of your images. LUTs can be used to create a wide range of effects, from subtle color adjustments to dramatic stylistic changes — it's like a pre-programmed filter, but with more flexibility and control. Use one of Retrobatch's LUT presets, or download additional LUTs that emulate film stocks, create specific moods (like warm, cool, or vintage), or simply enhance the natural colors in your image. You can also adjust the opacity and blending mode of the LUT. Use a grayscale LUT and then dial back the opacity to create some dramatic effects in your images. (Retrobatch Pro only) New \"Tile Chop\" node which will take an image and split it up into multiple images based on a width and height set in its properties. New \"Camera Capture\" node which uses your Mac's built in camera to take a photo (Retrobatch Pro only). Photos Export now has an option to export the Current, Unadjusted, or Original versions of your Photos Library images. *New \"Auto Process\" option in the RAW Import node. This lets you skip the fiddly options and just lets Retrobatch make the best guess at how the image should be processed. Two new nodes for renaming files. \"File Rename\" which will take one search string and replace it with another, and \"Web Safe Rename\" which will take a sequence of characters and then replace those with a given string. This is handy for tasks where you need to take out special characters or spaces from your images to make them easier for handling on the web. There's a new Advanced tab in Preferences, with some new options: A new \"Default Write Folder\" that will be used anytime you add a Write node. A \"Clear JavaScript console when a workflow runs\" option, which is useful for plugin authors. A \"Allow unknown file types\" option, which can be used to load ancient file types that MacOS no longer recognizes (Pro only). Find out more about this preference if you find it intriguing. There are additional changes and bug fixes of course. You can read all the gory details from the release notes. You can use the Retrobatch ▸ Check for Updates… menu item to get the latest release, or if you have downloaded it via the App Store you can update it from there. And of course, I've always got more planned so look for more fun stuff in the future.","link":"http://flyingmeat.com/blog/archives/2024/3/retrobatch_2.1.html","publishDate":"2024-03-20T18:19:32Z","guid":"http://flyingmeat.com/blog/archives/2024/3/retrobatch_2.1.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Retrobatch 2","description":"Retrobatch 2 is out! In case you're not aware, Retrobatch is a node based batch image processor, which means you can mix, match, and combine different operations together to make the perfect workflow. It's kind of neat. And version 2 is even neater. Here's the quick stats for the impatient: Retrobatch 2 requires MacOS 12 or later and it runs on Apple Silicon or Intel. It comes in 2.5 flavors: Retrobatch (regular): currently $19.99 one time fee. Comes with all 2.x upgrades. Retrobatch Pro: currently a $39.99 one time fee (or $24.99 if you're upgrading from 1.x). Also comes with all 2.x upgrades. It has more \"Pro\" features (aka, wacky things with color profiles, JavaScript, and more). Retrobatch Pro (App Store): $24.99 a year with a free 7 day trial. It also has some features missing because of App Store restrictions - but that may not matter to you. This is the first time Retrobatch has been on the App Store, so this is … slightly exciting? We'll see what happens. It's also nice being able to offer upgrade pricing on my own store again without feeling like I'm penalizing App Store folks. Gus's Favorite New Features The full release notes are available, but here's what I think are the coolest features: Command Bar: This is just like the Command Bar in Acorn, but I find it way more useful in Retrobatch for adding new nodes to the canvas. I no longer search through the little catalog - I just type and press enter. Dark Mode: It's nice? And it's about time it showed up? Larger Previews: The new way to view large previews is super easy. Select a node(s), hit the spacebar. A sheet comes up with node properties on the left, and a large preview on the right. It's a great way to dial in node properties. Super Resolution ML Scaling node: Retrobatch has a node which uses the Beby-GAN model to do 4x scaling of your images. This was a fun little project because the original model I used was over 60MB, but using Apple's coremltools I was able to quantize it down to just under 17MB. Machine learning models are awesome, but they can be pretty big. And going from a 32 bit model down to 8 bits didn't seem to impact the fidelity of what was generated. Photos Export node: This node replaces the previous \"Image Library\" node because of deprecations by Apple (they want me to stop using older APIs). This new node is more refined and lets you export your photos from your Photos library, and even download full resolution images from iCloud. I have a couple of interesting samples in the documentation on how to use it: Export RAW Images From Photos and Import to New Album as HEIC, which does what it sounds like. Export Photos To Multiple Folders With Size Limit, which will pull out photos and sort them into multiple folders based on how big the folder is getting. In the sample, the folders made will never exceed 10MB. It was inspired by an ATP episode where Marco Arment wanted to write his photos library to optical disks. Acorn Maker node: It makes native layered Acorn images. Combine that with the updated screenshot node and you can make layered screenshots straight from Retrobatch. Shortcuts Support: It's a simple implementation which lets you run workflows with gathered images, but since Shortcuts has system wide support, you can now make a workflow and run it straight from the Finder's Quick Actions menu. Updated Documentation The new documentation has more samples than ever. There are so many things you can do with Retrobatch, and I really need to start showing those things off. I've also started a little \"Technotes\" section where I hope to expand on little things in Retrobatch which are important to know about, but don't necessarily fit in the greater documentation. … Retrobatch is obviously not Flying Meat's most important app (Acorn would fill that role), but I really do like working on it and there's a bunch more ideas that I want to implement. I feel like Retrobatch is an app that the Mac needs, and it makes me incredibly happy to read all the nice letters I get from folks when they figure out how to use it in their daily work. Five years after Retrobatch 1 shipped, I'm happy to see version 2 out in the world. And I can't wait to see what folks are going to do with it.","link":"http://flyingmeat.com/blog/archives/2023/11/retrobatch_2.html","publishDate":"2023-11-07T22:12:39Z","guid":"http://flyingmeat.com/blog/archives/2023/11/retrobatch_2.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Back to School Sale","description":"We're rolling our 20th Anniversary sale* into a back to school sale. So while it's not as steep a discount as before, you can still pick up our apps at a low price for a while. But this time around we've brought bundling back. So you can purchase multiple copies of Acorn with a bigger discount, or mix and match by buying Acorn + Retrobatch, and save even more money on both apps. * Someone failed to write about Flying Meat's 20th Anniversary on the actual Flying Meat web site. This is a criminal act, and the offender has been sacked.","link":"http://flyingmeat.com/blog/archives/2022/8/back_to_school_sale.html","publishDate":"2022-08-20T01:21:52Z","guid":"http://flyingmeat.com/blog/archives/2022/8/back_to_school_sale.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"2 horses ran onto a Los Angeles freeway and were struck, killed by passing vehicles","description":"Two horses were struck and killed by passing vehicles after they ran onto a Los Angeles freeway","link":"https://abcnews.go.com/US/wireStory/2-horses-ran-los-angeles-freeway-struck-killed-111661549","publishDate":"Wed, 03 Jul 2024 19:28:06 -0400","guid":"https://abcnews.go.com/US/wireStory/2-horses-ran-los-angeles-freeway-struck-killed-111661549","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"How “Arrow” saved the CW, according to series EP Marc Guggenheim","description":"Guggenheim was warned that the DC Comics show had to be a hit or there would be no more network, he says.","link":"https://www.msn.com/en-us/tv/news/how-arrow-saved-the-cw-according-to-series-ep-marc-guggenheim/ar-BB1pnKGs","publishDate":"2024-07-04T04:33:58Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1pnKG4.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Tia Mowry Takes Moment to ‘Cherish’ Twin Tamera Ahead of Their 46th Birthday","description":"\"Having you by my side as we’ve grown and evolved has been an incredible blessing,\" Tia Mowry told Tamera Mowry-Housley in a sweet Instagram post","link":"https://www.msn.com/en-us/lifestyle/lifestyle-buzz/tia-mowry-takes-moment-to-cherish-twin-tamera-ahead-of-their-46th-birthday/ar-BB1pnzq9","publishDate":"2024-07-04T04:22:35Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1jw2UP.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Fight over retail theft is testing California Democrats' drive to avoid mass incarceration policies","description":"California Gov. Gavin Newsom and state leaders have dropped a plan to put a crime-focused measure on the ballot a day after announcing it","link":"https://abcnews.go.com/US/wireStory/fight-retail-theft-testing-california-democrats-strive-avoid-111662601","publishDate":"Wed, 03 Jul 2024 19:58:22 -0400","guid":"https://abcnews.go.com/US/wireStory/fight-retail-theft-testing-california-democrats-strive-avoid-111662601","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Stock market today: Japan's Nikkei 225 hits new record close, leading Asian shares higher","description":"Japan's benchmark Nikkei 225 has surged to a record close of 40,913.65, leading markets in most of Asia higher","link":"https://abcnews.go.com/US/wireStory/stock-market-today-japans-nikkei-225-hits-new-111667595","publishDate":"Thu, 04 Jul 2024 05:26:26 -0400","guid":"https://abcnews.go.com/US/wireStory/stock-market-today-japans-nikkei-225-hits-new-111667595","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"New Zealand tourist killed in robbery attempt at Southern California mall","description":"The victim of a botched robbery attempt at an upscale mall south of Los Angeles has been identified as a woman from New Zealand","link":"https://abcnews.go.com/US/wireStory/new-zealand-tourist-killed-robbery-attempt-southern-california-111661227","publishDate":"Thu, 04 Jul 2024 02:27:40 -0400","guid":"https://abcnews.go.com/US/wireStory/new-zealand-tourist-killed-robbery-attempt-southern-california-111661227","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Winning numbers drawn in Wednesday’s Powerball","description":"The winning numbers in Wednesday evening&rsquo;s drawing of the &quot;Powerball&quot; game were: 02-26-33-55-57, Powerball: 22","link":"https://abcnews.go.com/US/wireStory/winning-numbers-drawn-wednesdays-powerball-111666203","publishDate":"Thu, 04 Jul 2024 01:50:00 -0400","guid":"https://abcnews.go.com/US/wireStory/winning-numbers-drawn-wednesdays-powerball-111666203","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Democratic governors say they stand with Biden after 'candid' conversation, but are ‘worried’ about state of race","description":"Democratic governors say they stand with Biden after 'candid' conversation, but are &lsquo;worried&rsquo; about state of race","link":"https://abcnews.go.com/US/wireStory/democratic-governors-stand-biden-after-candid-conversation-worried-111663093","publishDate":"Wed, 03 Jul 2024 20:29:59 -0400","guid":"https://abcnews.go.com/US/wireStory/democratic-governors-stand-biden-after-candid-conversation-worried-111663093","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Polls open in British election in which voters appear eager for change after 14 years of Conservative government","description":"Polls open in British election in which voters appear eager for change after 14 years of Conservative government","link":"https://abcnews.go.com/US/wireStory/polls-open-british-election-voters-eager-change-after-111666806","publishDate":"Thu, 04 Jul 2024 03:26:00 -0400","guid":"https://abcnews.go.com/US/wireStory/polls-open-british-election-voters-eager-change-after-111666806","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Cybersecurity breach could delay court proceedings across New Mexico, public defenders office says","description":"New Mexico's statewide public defenders office says a recent cybersecurity breach could delay some court proceedings across the state","link":"https://abcnews.go.com/US/wireStory/cybersecurity-breach-delay-court-proceedings-new-mexico-public-111663092","publishDate":"Wed, 03 Jul 2024 20:38:00 -0400","guid":"https://abcnews.go.com/US/wireStory/cybersecurity-breach-delay-court-proceedings-new-mexico-public-111663092","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Biden at 81: Often sharp and focused but sometimes confused and forgetful","description":"Behind closed doors, in the Oval Office, on Air Force One or in meetings around the world, many people describe President Joe Biden in the same dual way","link":"https://abcnews.go.com/US/wireStory/biden-81-sharp-focused-confused-forgetful-111663184","publishDate":"Wed, 03 Jul 2024 22:54:27 -0400","guid":"https://abcnews.go.com/US/wireStory/biden-81-sharp-focused-confused-forgetful-111663184","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"A Quick Tip for Cropping a Single Layer","description":"Here's a neat little trick you can use in Acorn 7 and later. If you have a single layer you'd like to crop without changing the size of the image (for whatever reason - I know you have one), you can use the crop tool like you normally would, and when holding down the option key when you're ready to make your crop, the \"Crop Image\" button in the palette will change it's text to \"Crop Layer\". Clicking on it will trim your layer of unnecessary pixels. You can also double click on the canvas with the option key down and Acorn will crop the current layer only. You can of course get the same effect using the select tool, using the Select ▸ Inverse menu item, and then pressing the delete key. But our minds all work a little different so it's nice to have multiple ways of doing something.","link":"http://flyingmeat.com/blog/archives/2023/5/quick_tip_for_cropping_a_single_layer.html","publishDate":"2023-05-19T16:35:56Z","guid":"http://flyingmeat.com/blog/archives/2023/5/quick_tip_for_cropping_a_single_layer.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Hezbollah says it has fired 200 rockets into Israel in one of its largest barrages yet, after killing of commander","description":"Hezbollah says it has fired 200 rockets into Israel in one of its largest barrages yet, after killing of commander","link":"https://abcnews.go.com/US/wireStory/hezbollah-fired-200-rockets-israel-largest-barrages-after-111667974","publishDate":"Thu, 04 Jul 2024 05:26:00 -0400","guid":"https://abcnews.go.com/US/wireStory/hezbollah-fired-200-rockets-israel-largest-barrages-after-111667974","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Haiti's prime minister says Kenyan police are crucial to controlling gangs, early days are positive","description":"Haitian Prime Minister Garry Conille told the U.N. Security Council that recently deployed Kenyan police will be crucial to helping control the country&rsquo;s gangs and moving toward democratic elections","link":"https://abcnews.go.com/US/wireStory/haitis-prime-minister-kenya-police-crucial-controlling-gangs-111661830","publishDate":"Thu, 04 Jul 2024 01:50:17 -0400","guid":"https://abcnews.go.com/US/wireStory/haitis-prime-minister-kenya-police-crucial-controlling-gangs-111661830","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Japan's Nikkei 225 benchmark closes at a fresh record high of 40,913.65, pushing past its record close set in March","description":"Japan's Nikkei 225 benchmark closes at a fresh record high of 40,913.65, pushing past its record close set in March","link":"https://abcnews.go.com/US/wireStory/japans-nikkei-225-benchmark-closes-fresh-record-high-111667250","publishDate":"Thu, 04 Jul 2024 03:50:00 -0400","guid":"https://abcnews.go.com/US/wireStory/japans-nikkei-225-benchmark-closes-fresh-record-high-111667250","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"California man convicted of first-degree murder in killing of gay University of Pennsylvania student in a 2018 stabbing","description":"California man convicted of first-degree murder in killing of gay University of Pennsylvania student in a 2018 stabbing","link":"https://abcnews.go.com/US/wireStory/california-man-convicted-degree-murder-killing-gay-university-111661405","publishDate":"Wed, 03 Jul 2024 19:17:49 -0400","guid":"https://abcnews.go.com/US/wireStory/california-man-convicted-degree-murder-killing-gay-university-111661405","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"The questions about Biden's age and fitness are reminiscent of another campaign: Reagan's in 1984","description":"In 1984, President Ronald Reagan answered the age question with a clever joke that reset his campaign from a stumbling debate performance to a 49-state landslide and a second term","link":"https://abcnews.go.com/US/wireStory/questions-bidens-age-fitness-reminiscent-campaign-reagans-1984-111665472","publishDate":"Thu, 04 Jul 2024 04:46:25 -0400","guid":"https://abcnews.go.com/US/wireStory/questions-bidens-age-fitness-reminiscent-campaign-reagans-1984-111665472","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Man charged in connection to mass shooting at Oakland Juneteenth celebration","description":"A 23-year-old Oakland man has been charged in connection with a mass shooting that wounded 14 at a Juneteenth celebration last month","link":"https://abcnews.go.com/US/wireStory/man-charged-connection-mass-shooting-oakland-juneteenth-celebration-111663280","publishDate":"Wed, 03 Jul 2024 22:16:05 -0400","guid":"https://abcnews.go.com/US/wireStory/man-charged-connection-mass-shooting-oakland-juneteenth-celebration-111663280","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Lightning strike blamed for wildfire that killed 2 people in New Mexico, damaged 1,400 structures","description":"Authorities say a lightning strike caused the larger of two wildfires that has killed at least two people and destroyed or damaged more than 1,400 structures in New Mexico","link":"https://abcnews.go.com/US/wireStory/lightning-strike-blamed-wildfire-killed-2-people-new-111661652","publishDate":"Wed, 03 Jul 2024 22:54:17 -0400","guid":"https://abcnews.go.com/US/wireStory/lightning-strike-blamed-wildfire-killed-2-people-new-111661652","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Acorn 7.4.3 Released","description":"Acorn 7.4.3 is out, and it's a free update for anyone with an Acorn 7 license. This release is mostly about bug fixes, but I snuck in a couple of little things, one of which has been asked for a bunch of times over the years: the ability to know the number of pixels you've got in a selection. The count shows up in the Selection palette right below the width and height fields. There's also a new \"New Auto Level / Straighten\" command, layered screenshot improvements, and a couple more things. You can read the gory details in the full release notes. One more super geeky thing I've added is a JavaScript Console: This tool is really meant for folks developing plugins in Acorn, and it is only accessible from the Command Bar, but a part of me absolutely loves pointing out little things like this. I was just chatting with Brent Simmons the other day at Xcoders how you can't really spelunk in apps any more because of all the restrictions that are (justifiably) put on recent MacOS releases. While a console isn't exactly a spelunking tool, I still think it's kind of cool and fun and maybe someone will discover it accidently and that will inspire them to do stupid and entertaining things like we used to do back in the 10.x days. Anyway, here's a picture of some groovy flowers out of the 1970s, because I'm still stuck on the ’74 theme for recent Acorn releases.","link":"http://flyingmeat.com/blog/archives/2023/9/acorn_7.4.3_released.html","publishDate":"2023-09-25T19:54:15Z","guid":"http://flyingmeat.com/blog/archives/2023/9/acorn_7.4.3_released.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"UK opposition leader Keir Starmer casts his vote in an election that his Labour Party is widely expected to win","description":"UK opposition leader Keir Starmer casts his vote in an election that his Labour Party is widely expected to win","link":"https://abcnews.go.com/US/wireStory/uk-opposition-leader-keir-starmer-casts-vote-election-111667975","publishDate":"Thu, 04 Jul 2024 05:26:00 -0400","guid":"https://abcnews.go.com/US/wireStory/uk-opposition-leader-keir-starmer-casts-vote-election-111667975","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"California man convicted of murder in 2018 stabbing death of gay University of Pennsylvania student","description":"A California man has been convicted of murder with a hate crime enhancement for the 2018 stabbing of a gay University of Pennsylvania student","link":"https://abcnews.go.com/US/wireStory/california-man-convicted-murder-2018-stabbing-death-gay-111661550","publishDate":"Wed, 03 Jul 2024 21:34:15 -0400","guid":"https://abcnews.go.com/US/wireStory/california-man-convicted-murder-2018-stabbing-death-gay-111661550","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Nathan's Famous Independence Day hot dog contest set for NYC — minus its usual muncher","description":"Competitive hot dog eaters from around the world are competing in New York City on Independence Day to see how many franks they can eat in 10 minutes","link":"https://abcnews.go.com/US/wireStory/nathans-famous-independence-day-hot-dog-contest-set-111665469","publishDate":"Thu, 04 Jul 2024 00:38:26 -0400","guid":"https://abcnews.go.com/US/wireStory/nathans-famous-independence-day-hot-dog-contest-set-111665469","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Miranda Cosgrove Says She Wants to 'Wrap Up' 'iCarly' With a Movie (Exclusive)","description":"The actress spoke with ET at a screening of her new film 'Mother of the Bride' in the Pacific Palisades.","link":"https://www.msn.com/en-us/tv/news/miranda-cosgrove-says-she-wants-to-wrap-up-icarly-with-a-movie-exclusive/ar-BB1m4whs","publishDate":"2024-07-04T04:29:32Z","guid":null,"image":null,"author":null,"comments":null,"enclosures":null,"imgURL":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1pnQ7o.img","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Americans to celebrate Fourth of July with parades, cookouts — and lots of fireworks","description":"All signs point to big celebrations for Americans this Fourth of July","link":"https://abcnews.go.com/US/wireStory/americans-celebrate-fourth-july-parades-cookouts-lots-fireworks-111665569","publishDate":"Thu, 04 Jul 2024 01:42:16 -0400","guid":"https://abcnews.go.com/US/wireStory/americans-celebrate-fourth-july-parades-cookouts-lots-fireworks-111665569","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0},{"title":"Propulsion engineer is charged with obstructing probe of deadly 2017 US military plane crash","description":"A former engineer at a U.S. military air logistics center is charged with making false statements and obstructing justice during a criminal investigation into a 2017 military plane crash in Mississippi that killed 16 service members","link":"https://abcnews.go.com/US/wireStory/propulsion-engineer-charged-obstructing-probe-deadly-2017-us-111661831","publishDate":"Wed, 03 Jul 2024 19:34:28 -0400","guid":"https://abcnews.go.com/US/wireStory/propulsion-engineer-charged-obstructing-probe-deadly-2017-us-111661831","image":null,"author":null,"comments":null,"enclosures":[],"imgURL":null,"imgType":null,"imgLength":null,"imgWidth":0}]