[{"title":"Seattle Before the iPhone #1 - Luke Adamson","description":"This episode was recorded 15 May 2013 live and in person at The Omni Group’s lovely offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes or subscribe to the podcast feed. Luke Adamson is a founder of Toy Rockets. He’s a former instructor at the University of Washington’s iOS and Mac certificate program and a former developer at The Omni Group (where, among other things, he helped create OmniOutliner). This episode is sponsored by Microsoft Azure Mobile Services. Does your app need online services? Syncing? Storage? Mobile Services is the easiest way to get started. Create your own APIs. Write your code using JavaScript (Mobile Services runs Node.js). Store data in a SQL database and/or in blob storage. Develop using your favorite text editor and terminal app on your favorite computer — a Mac. And never ever worry about applying security patches to a server. A trial account is free. Things we mention, in order of appearance (roughly): Gophers Idaho Meth Maze War Boise State U Nextstation UUCP HP Usenet Commodore 64 BASIC Pascal Objective-C C++ Win16 AppKit Foundation NSString University of Idaho The Omni Group Texas A&M OmniWeb OmniPDF WebObjects Lighthouse Design Diagram! Quantrix Wainscoting EOF Standard & Poor’s Mitsubishi Toyota McCaw Cellular Oracle 8 Craig Federighi Bruce Arthur Solaris Sybase G4 Ireland Quake HP-UX Doom John Carmack Java BeOS Adobe PowerPC Power Computing Webscript Lisp Swing Toolkit AWT Ken Case Tim Wood Wil Shipley Greg Titus Andrew Abernathy Tom Bunch Retrospect Steve Nygard Class-dump OmniOutliner Visio Rhapsody OmniGraffle Illustrator Mazda RX-7 FrontBase Denmark Cinema Displays TiBook Everett, Washington Blue hair Sub-prime mortgages Bear Stearns Deutsche Bank Credit Suisse Internap Xserve Ubermind Deloitte Digital Societe General India iOS Jailbroken iPhones Lucas Newman","link":"http://therecord.co/2014/01/03/luke_adamson.html","publishDate":"2014-01-03T19:10:00Z","guid":"http://therecord.co/2014/01/03/luke_adamson.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Seattle Before the iPhone #2 - John Nack","description":"This episode was recorded 22 May 2013 live and in person at Adobe’s offices in Fremont in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) John Nack is Principal Product Manager, Adobe Digital Video. He has a blog (definitely worth reading, especially if you use Photoshop) and is @jnack on Twitter. This episode is sponsored by Microsoft Azure Mobile Services. One of the cooler features recently added is the ability to create custom APIs. Originally you were limited to standard operations on your database tables — but now you can design any API you want. This allows you to create a full REST/JSON API that’s tailored to your app, that works as efficiently as possible. (And it’s all in JavaScript. Mobile Services runs Node.js. Write your apps in your favorite text editor on your Mac.) Things we mention, in order of appearance (pretty much): Adobe LiveMotion Photoshop John’s Blog Kurt Vonnegut Granfalloons despair.com Cocoa 64-bit Carbon 64-bit Unfrozen Cave Man Olive Garden South Bend, Indiana Tiramisu St. Sebastian Breadsticks Monkeys 2005 Movable Type DeBabelizer GifBuilder Anarchie 1984 Mac 2001 Algonquin Hotel Apple II PCjr ASCII Art Clip Art Googly Eyes Bill Atkinson MacPaint Rorschach Test Apple II GS Great Books Quadra 840AV Quadra Ad Director SuperCard Søren Kierkegaard Immanuel Kant Notre Dame Football Windows NT HTML New York City 1998 Flash Macromedia Illustrator Navy ROTC San Francisco GoLive NetNewsWire After Effects Thomas Knoll Camera Raw Photoshop Touch Germany Philistinism Perfectionism Volkswagen Carbon-dating Web Standards SVG CSS Gus Mueller Acorn Neven Mrgan Khoi Vinh Croatia Portland JDI Healing Brush Buck Rogers Creative Cloud Facebook Smugmug WWDC Jetta Ketchup Death-march Comic Book Guy John Gruber “If you see a stylus, they blew it.” Microsoft Surface Metro UI Rahm Emmanuel: “You never want a serious crisis to go to waste.” The Mythical Man-Month Content-Aware Fill Shawshank InDesign Adobe Magazine Nike PageMaker Postscript SLR Lightroom Black & Decker Dr. Evil Loren Brichter Instagram Kickstarter NGO Tumblr Acquisition Troy Gaul Blurb The Onion: Report: 98 Percent Of U.S. Commuters Favor Public Transportation For Others Data T-1000 Syria MacApp Resource Manager John Knoll Industrial Light & Magic QuickTime OpenDoc Corba OLE SnapSeed Mac System 6 Apple events AppleScript Audio Bus 1992 “The only time you should start worrying about a soldier is when they stop bitchin’” Alan Kay: “The Mac is the first computer good enough to be criticized.” TapBots Tweetbot 2 Android Kai’s Power Tools Kai Krause Fremont RUN DMC Porsche Boxster Flavawagon Google Glass Robert Scoble","link":"http://therecord.co/2014/01/17/john_nack.html","publishDate":"2014-01-17T18:00:00Z","guid":"http://therecord.co/2014/01/17/john_nack.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Seattle Before the iPhone #8 - Nathaniel Irons","description":"This episode was recorded 16 May 2013 live and in person at Omni’s lovely offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Nat Irons has worked at Apple Developer Relations, as a WebObjects consultant, and as IT director at The Stranger. He’s now QA Manager at Black Pixel. He once delivered pizza to The Far Side author Gary Larson. This episode is sponsored by Igloo. Igloo is an intranet you’ll actually like, with shared calendars, microblogs, file-sharing, social networking, and more. It’s free for up 10 users — give it a try for your company or your team today. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. It’s high level — you can get more done with less work. Things we mention, in-order-of-appearance-ish: Lode Runner Dark Castle Windows Boston San Francisco Berkeley, CA Bay Area High school Seattle Tim Eyman Sit & Spin Blogger Meetup Natty Bumppo bumppo.net James Fenimore Cooper Leatherstocking Tales Michael Mann Daniel Day Lewis Last of the Mohicans movie AOL chatrooms Berkeley Macintosh User Group (BMUG) BBS First Class BBS Tim Holmes Purple Harley BMUG Newsletter Modems Heidi Roizen Bleeding in six colors Twitter Bolo Spectre Stuart Cheshire Virtual Reality Bonjour ZeroConf Cheshire Cat Stuart Little Alice PERL Excel Mac OS 9 iMac Floppy drive ADB USB NeXT Rhapsody UNIX Terminal.app BBEdit SE/30 Apple in middle of menubar MPW MacPerl Latent Semantic Mapping (LSM) Regular expressions WWDC Homer Simpson in The Land of Chocoloate Schadenfreude MacInTouch NPR Microsoft Microsoft invests in Apple and pledges to keep developing Office for Mac Powerbook G3 Filemaker Pro Claris Microsoft Access Bento Apple events Farallon Chuck Shotton WebSTAR MacHTTP StarNine Quarterdeck Apache Open Transport Xcode WebObjects Java Bill Bumgarner Objective-C categories SSH tunnels 1999 Redmond 2000 Maria Cantwell King County Pierce County Eastern Washington secession Shoreline Queen Anne Ballard Magnolia Discovery Park Capitol Hill Pagliacci Pizza 2003 Sand Point Gary Larson Dumbledore The Far Side San Francisco Academy of Sciences Workmen’s Compensation Virgina Mason 2001 2002 Upcoming.org Seattle Weekly Dan Savage The Rocket Lynda Barry Life in Hell Matt Groening Evergreen State College University Village Apple Store Seattle Xcoders Dave Winer Daniel Pasco C4 Paul Goracke Black Pixel job listings","link":"http://therecord.co/2014/04/11/nat_irons.html","publishDate":"2014-04-11T18:45:00Z","guid":"http://therecord.co/2014/04/11/nat_irons.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Seattle Before the iPhone #5 - Paul Goracke","description":"This episode was recorded 16 May 2013 live and in person at Omni’s lovely offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Paul Goracke is a senior staff engineer at Black Pixel, where he works on things he can’t talk about but that you’ve used. He’s also a former instructor at the University of Washington’s Cocoa development program, and has at times been the lead organizer of the Seattle Xcoders. This episode is sponsored by Squarespace. Get 10% off by going to http://squarespace.com/therecord. Better still: go work for Squarespace! They’re hiring 30 engineers and designers by March 15, and, “When you interview at Squarespace, we’ll invite you and your spouse or partner to be New Yorkers for a weekend—on us.” The great designers at Squarespace have designed an entire weekend for you, from dining at Alder to going to the Smalls Jazz Club and visiting The New Museum. Seriously cool deal at beapartofit.squarespace.com. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. Write code — Javascript code — in your favorite text editor on your Mac. (Mobile Services runs Node.js.) Deploy via git. Write unit tests using mocha (or your tool of choice). Supports authenticating via Twitter, Facebook, and Google — and you can roll your own system. It’s cool. Things we mention, in order of appearance (more or less): CodeWarrior SIOUX-WASTE TextEdit 32K limit WASTE Usenet Metrowerks Ron John Daub Compact Discs Adobe MacTech on SIOUX WorldScript Unicode UTF-8 PowerPC Apprentice CDs DNA sequencers California Stanford Sun workstation PC Minnesota Egghead Software NFR copies Think C Think C Reference Learn C on the Macintosh Inside Mac Scott Knaster book Ultimate Mac Programming Guide Apple events Inside OLE 4th Dimension Guy Kawasaki Apple II Atari Commodore VisiCalc BASIC Nibble magazine Elephant Disks Beagle Bros. Byte TRS-80 Creative Computing 6502 C pointers fseek Apple IIe Apple IIgs Lemonade Stand Token rings 1994 The Computer Store Powerbook 180 Filemaker SQL HyperCard Myst Broderbund Sierra On-Line King’s Quest PowerPlant Flash JavaScript Java Applet Remote Method Invocation Java Native Interface Windows NT Classpaths Bioinformatics Perl use strict Berkeley DB MySQL RedHat Linux Emacs Quartz Composer Grok Forth Seattle Xcoders 2004 2005 NSCoder Night CocoaHeads Pirate flag Advanced Mac OS X Programming book Gus Mueller Rogue Sheep MacBU OmniGroup dBug Lucas Newman Mike Lee Wil Shipley Golden Braeburn Joe Heck Hal Mueller WWDC Luau SFMacIndie Party Jillian’s Jacqui Cheng Clint Ecker Guy English C4 NeXT BeOS UW Salvage Subversion Versions John Flansburgh Northside","link":"http://therecord.co/2014/02/28/paul_goracke.html","publishDate":"2014-02-28T19:40:00Z","guid":"http://therecord.co/2014/02/28/paul_goracke.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Seattle Before the iPhone #3 - Greg Robbins","description":"This episode was recorded 16 May 2013 live and in person at Omni’s offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Greg Robbins is Graphing Calculator co-author (a story you should already know about, that we don’t go over again) and has done such diverse things as bringing translucency to the Mac OS Drag Manager (way back in the ’90s), and writing an open source Objective-C library for Google Data APIs. You can follow Greg on Twitter. This episode is sponsored by Squarespace. Easily create beautiful websites via drag-and-drop. Get help any time from their 24/7 technical support. Create responsive websites — ready for phones and tablets — without any extra effort: Squarespace’s designers have already handled it for you. Get 10% off by going to http://squarespace.com/therecord. And, if you want to get under the hood, check out their APIs at developers.squarespace.com. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. If you’ve been to the website already, you’ve seen the tutorials where you input code into a browser window. And that’s an easy way to get started. But don’t be fooled: Mobile Services is deep. You can write in your favorite text editor and deploy via Git. Regular-old Git, not Git#++. Git. Things we mention, in order of appearance (pretty much): Real Networks Graphing Calculator Google Ira Glass on Graphing Calculator Drag Manager Translucency Mac OS 7.5.3 Drag Manager Alpha channels Quartz CopyBits Black and white displays 68K computers PowerPC Blitting Desktop Pictures 1995 NeXT Omni Assembly language DTS Newton Teletypes Berkeley’s Lawrence Hall of Science Apple II 1979 Mainframe Concentration Busboy Nolo Press ComputerLand Beagle Bros. Integer BASIC 80-column cards Apple II Plus Apple II Technical Manual Homebrew computers RF Interference Apple II GS Non-Apple Machines 6502 Assembly Missile Command 1992 NASA Neural networks Robert Hecht-Nielsen 1980s Voice recognition Earth Observing System Goddard Space Flight Center comp.sys.mac Pascal C Macintosh Progammers Workshop (MPW) Lightspeed C / THINK C Lightspeed Pascal CodeWarrior PowerPC transition Toolbox Inside Mac Macintosh Programmers Toolbox Assistant QuickView Hypercard How to Write Macintosh software by Scott Knaster 1990s eMate Apple QuickTake Secret About Box Easter eggs Breakout in 7.5 Herman the Iguana Pointers Ron Avitzur Airplay Front Row Windows Vista Microsoft Office Adobe Photoshop Seattle RealPlayer 1998 Rob Glaser Macworld Conference Marching extensions Casady & Greene’s Conflict Catcher Carbon Cocoa 2002 WinAmp Appearance Manager Kaleidoscope Copland InternetWorld 1997 OpenDoc Dave Winer Quickdraw GX Apple Open Collaborative Environment (AOCE) iCloud LLVM Instruments Microsoft Visual Studio ARC C# Xcode Eclipse QuickTime Project Builder Google Desktop Spotlight Google Maps for iOS 2005 Macintosh Business Unit (MacBU) RSS Google Reader Google Keep Self-driving cars Google Glass Big data Google Data APIs for Objective-C XML OAuth","link":"http://therecord.co/2014/01/31/greg_robbins.html","publishDate":"2014-01-31T20:00:00Z","guid":"http://therecord.co/2014/01/31/greg_robbins.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Special #2 - Brent Simmons","description":"This episode was recorded 26 May 2014 live and in person at Brent’s office in sunny, lovely Ballard. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Brent has worked at UserLand Software and NewsGator and as an indie at his company Ranchero Software. These days he’s one-third of Q Branch, where he writes Vesper. He is also the co-host of this podcast. This episode is sponsored by Tagcaster. Tagcaster is not just another podcast client — it solves the age-old problem of linking to specific parts of a podcast. You can make clips — short audio excerpts — and share them and link to them. After all these years, that problem is finally solved. This episode is also sponsored by Igloo. Igloo is an intranet you’ll actually like, with shared calendars, microblogs, file-sharing, social networking, and more. It’s free for up 10 users — give it a try for your company or your team today. This episode is also sponsored by Hover. Hover makes domain name management easy. And it’s a snap to transfer domains from other registrars using their valet service. Get 10% off your first purchase with the promotional code MANILA. (Manila was the name of the blogging system worked on at UserLand.) Take a look. Things we mention, more or less in order of appearance: NetNewsWire MarsEdit Glassboard Vesper Manila The University of Chicago DuPont Punched cards University of Delaware Newark, Delaware Fortran 1980 Apple II Plus PLATO Brent's Mom 6502 Assembly 80 column card ALF II Music Construction Set Beatles Rolling Stones Pil Ochs Judy Collins Boby Dylan West Side Story Hair Broadway Soundtrack Delicious Library Epson MX-80 Columbia House Records Cindy Lauper Born in the USA The Clash London Calling Pascal Evergreen State College 1992 1989 Seattle Central Community College City Collegian QuarkXpress LaserWriter Mac IIcx Radius monitor Silo Goodwill Symantec C Grenoble, France Microsoft Word Microsoft Excel Seattle Boeing Photovoltaics University of Washington Institut de Biologie Structurale CEA CNRS Alps (the mountains) Gopher Pine International Herald Tribune Kronenbourg Killian’s Red Isère River Chinook's Eskimo dial-up account Zterm Lynx AltaVista Seanet MacTCP MacPPP AppleTalk Yahoo Info-Mac Archive Kagi Maelstrom Performa 604 After Dark Bungie Andrew Welch Usenet fuckingblocksyntax.com Dave Winer UserLand Frontier Aretha release UserLand Software AppleScript HyperCard WebSTAR MacPerl MySQL Spotlight Filemaker Pro Indianapolis Star News Woodside, CA Jake Savin San Francisco Robert Scoble Millbrae Palo Alto Windows Visual Studio CodeWarrior PowerPlant MacApp Toolbox Xcode Project Builder Carbon QuickDraw Open Transport Manila EditThisPage.com Daily Kos joel.editthispage.com Aaron Hillegass’s Book on Cocoa Radio UserLand Python MacNewsWire RSS WebKit Safari MSIE for Mac Camino NetNewsWire 1.0 screen shot RealBasic BBEdit Lite TextWrangler Carmen’s Headline Viewer Syndirella AmphetaDesk My.Netscape.Com Safari/RSS Ecto Movable Type Mac OS X Server NewsGator Palm Treo FeedDemon Nick Bradbury Greg Reinacker Outlook TapLynx Push IO Sepia Labs Cultured Code and Things Black Pixel Red Sweater Oracle Justin Wiliams NetNewsWire Lite 4.0 for Macintosh Vesper Sync Diary WWDC Parc 55","link":"http://therecord.co/2014/05/29/brent_simmons.html","publishDate":"2014-05-29T12:00:00Z","guid":"http://therecord.co/2014/05/29/brent_simmons.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Seattle Before the iPhone #9 - Mike Lee","description":"This episode was recorded 17 May 2013 live and in person at Omni’s beautiful offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Mike Lee, Appsterdam founder, has worked at Alaska Airlines, Delicious Monster (with Wil Shipley), Apple, and is now Chief Lemur at New Lemurs. This episode is sponsored by Hover. Hover makes domain name management easy. And it’s a snap to transfer domains from other registrars using their valet service. Get 10% off your first purchase with the promotional code BMF. (BMF -- Be My Friend — is Mike Lee’s Twitter handle.) You notice how people with a lot of domains are always talking about Hover? It’s because of their excellent service. Take a look. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. It’s high level — you can get more done with less work. It’s also deep: write JavaScript in your favorite text editor. Test with mocha. Deploy with git. Things we mention, in order of appearance (mostly): Kurt Cobain Grunge Honolulu Hawaii University of Puget Sound Tacoma Puget Sound Alaska Airlines SeaTac Lead ramp agent Skilled labor 1993 Choose Your Own Adventure DHTML Flash Web Standards Project XML Java C# DotNet Macintosh PC Microsoft Windows Windows 95 Mac OS X Terrorist watch list WWDC JavaOne Objective-C Xcode 2005 2001 Renoir Hotel WWDC Student Scholarship Wil Shipley Wil Shipley’s Speech on the Indie Dream Devry FedEx Core Data Bill Bumgarner Federal Way I-5 Delicious Library Apple Design Award Campus Bash Denny’s Omni Group Rumpus Room Apple Store Barnes & Noble Lucas Newman Mike Matas Knoxville Samurai Yoko Ono Seattle Xcoders Gus Mueller Heisenberg Uncertainty Principle Dave Winer Superman IL 7 John Geleynse Lemur Chemistry Cabel Sasser “Hi, I Make Macintosh Software” T-shirt altWWDC Debug podcast Tapulous Tap Tap Revenge iFart DTS IL 3 Caffè Macs Rands Matt Drance Michael Jurewitz","link":"http://therecord.co/2014/04/25/mike_lee.html","publishDate":"2014-04-25T18:30:00Z","guid":"http://therecord.co/2014/04/25/mike_lee.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"“The Traitors” season 3 cast includes “Survivor” and “Big Brother” legends — and Britney Spears' ex!","description":"The hit reality show, and its dapper host Alan Cumming, return for some more mysteries and muuuurrrrderrrr on Peacock.","link":"https://www.msn.com/en-us/tv/news/the-traitors-season-3-cast-includes-survivor-and-big-brother-legends-and-britney-spears-ex/ar-BB1nG3xF","publishDate":"2024-06-05T12:45:00Z","guid":"BB1nG3xF","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nG18b.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/tv/news/the-traitors-season-3-cast-includes-survivor-and-big-brother-legends-and-britney-spears-ex/ar-BB1nG3xF","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Seattle Before the iPhone #6 - Tim Wood","description":"This episode was recorded 17 May 2013 live and in person at Omni’s lovely offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Tim Wood, CTO of The Omni Group, talks about how Omni got started and what it was like being a NeXT developer before the acquisition. This episode is sponsored by Squarespace. Easily create beautiful websites via drag-and-drop. Get help any time from their 24/7 technical support. Create responsive websites — ready for phones and tablets — without any extra effort: Squarespace’s designers have already handled it for you. Get 10% off by going to http://squarespace.com/therecord. And, if you want to get under the hood, check out their APIs at developers.squarespace.com. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. If you’ve been to the website already, you’ve seen the tutorials where you input code into a browser window. And that’s an easy way to get started. But don’t be fooled: Mobile Services is deep. You can write in your favorite text editor and deploy via Git. Regular-old Git, not Git#++. Git. Things we mention, in order of appearance (more or less): Atari 800 BASIC Tacoma, WA Commodore Apple II 6502 Assembler Atari ST Compute! Magazine Burroughs Mainframes Radio Shack NeXT Mac University of Washington H19 Terminal Fortran Mathematica LaTeX Java Ada Boeing Department of Defense VMS IBM 360 Objective-C AppKit Interface Builder Project Builder Makefiles Read-write Optical drives Wil Shipley Ken Case Greg Titus Tom Bunch Massively multiplayer games Minecraft MOOs MUSHes CompuServe Ultima Online William Morris Agency McCaw Cellular 1992 Framemaker Adobe Lighthouse Design Diagram! OmniGraffle 1994 www.app OmniWeb Blink tag Rocky & Bullwinkle Rhapsody Hewlett Packard Sun OpenStep Solaris Windows NT Be Jean-Louis Gasée Enterprise Objects Framework Core Data Avie Tevanian Jon Rubinstein Bertrand Serlet Craig Federighi Appletalk Yellow Box HP-UX Andrew Stone Doom Id Software Wil’s mail OpenGL John Carmack DirectX OmniOutliner Comic Life NCSA GCD Blocks Functional programming Mac Pro Go Rust Race conditions OmniPresence Own the Wheel iCloud Core Data Syncing Rich Siegel Yojimbo Sync Services </ul>","link":"http://therecord.co/2014/03/14/tim_wood.html","publishDate":"2014-03-14T20:00:00Z","guid":"http://therecord.co/2014/03/14/tim_wood.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Seattle Before the iPhone #4 - Gus Mueller","description":"This episode was recorded 17 May 2013 live and in person at Omni’s lovely offices overlooking Lake Union in Seattle. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Gus Mueller, Flying Meat founder, created VoodooPad (now at Plausible Labs) and Acorn, the image editor for humans. Gus is also responsible for open source software such as FMDB and JSTalk. This episode is sponsored by Squarespace. Get 10% off by going to http://squarespace.com/therecord. Better still: go work for Squarespace! They’re hiring 30 engineers and designers by March 15, and, “When you interview at Squarespace, we’ll invite you and your spouse or partner to be New Yorkers for a weekend—on us.” The great designers at Squarespace have designed an entire weekend for you, from dining at Alder to going to the Smalls Jazz Club and visiting The New Museum. Seriously cool deal at beapartofit.squarespace.com. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. Write code — Javascript code — in your favorite text editor on your Mac. (Mobile Services runs Node.js.) Deploy via git. Write unit tests using mocha (or your tool of choice). Supports authenticating via Twitter, Facebook, and Google — and you can roll your own system. It’s cool. Things we mention, in order of appearance (more or less): Rock climbing Luke Adamson Missouri 2001 2002 Cocoa Apple IIc 1993 Mac Color Classic BASIC ELIZA Artificial Intelligence Assembler Missile Command Java Eric Albert Perl Animated GIFs CGIs Server push images REALBasic PC Apple IIe DOS Colossal Caves Plover Nibble Civilization UNIX AIX A/UX St. Louis Columbia Math is hard Single sign-on Servlets OS X WWDC Rhapsody 1995 MacPERL NiftyTelnet BBEdit FlySketch Coffee Picasso’s bull sketches VoodooPad 22\" Cinema Display OS X Innovator’s Award O’Reilly Peter Lewis Rich Siegel Mark Aldritt Ambrosia Panic Transmit Audion O’Reilly Mac OS Conference Audio Hijack Paul Kafasis SubEthaEdit Mac Pro Ireland XML PDF Victoria’s Secret Caterpillar Adobe InDesign OS X Server Xserve Macintosh G5 MacUpdate VersionTracker QuickDraw Kerberos HyperCard Objective-C messaging system Aaron Hillegass’s book Java-Cocoa bridge JDBC Oracle databases 2005 Seattle Microsoft Parents Just Don’t Understand Vancouver, BC B.B. King Seattle Xcoders Joe Heck University of Missouri Evening at Adler Wil Shipley Daniel Jalkut Eric Peyton Quicksilver Rosyna Chicago Drunkenbatman Adler Planetarium C4 Wolf Colin Barrett Delicious Generation Disco.app My Dream App Chimera / Camino Santa Clara World Wrapps Buzz Andersen Quartz Core Image Filters Bezier curves Wacom Unit tests Automated builds ZeroLink Metrowerks CodeWarrior NeXT BeOS Macintosh Performa Display Postscript SGIs Sun boxes Mac OS 8 MachTen Netscape Internet Explorer for Mac OS Outlook Express OmniGroup Shakespeare’s pizza Pagliacci Neapolitan pizza Everett FIOS Fender Stratocaster GarageBand AudioBus Adobe Photoshop Adobe Photoshop Elements JSTalk AppleScript SQLite WebKit Napkin","link":"http://therecord.co/2014/02/14/gus_mueller.html","publishDate":"2014-02-14T18:00:00Z","guid":"http://therecord.co/2014/02/14/gus_mueller.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Dwayne Johnson's ‘The Smashing Machine' to Release in Italy via I Wonder Pictures as Distributor Forges Closer Ties With A24","description":"Italy's I Wonder Pictures has acquired Italian rights to three new titles from A24, including Benny Safdie's hotly anticipated “The Smashing Machine” with Dwayne Johnson and Emily Blunt. The move solidifies an ongoing rapport between the indie U.S. studio and the growing Italian distributor. “Smashing Machine,” which is currently in production and stars “The Rock” […]","link":"https://www.msn.com/en-us/movies/news/dwayne-johnson-s-the-smashing-machine-to-release-in-italy-via-i-wonder-pictures-as-distributor-forges-closer-ties-with-a24/ar-BB1nG6JQ","publishDate":"2024-06-05T12:45:45Z","guid":"BB1nG6JQ","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nFWZa.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/movies/news/dwayne-johnson-s-the-smashing-machine-to-release-in-italy-via-i-wonder-pictures-as-distributor-forges-closer-ties-with-a24/ar-BB1nG6JQ","imgType":null,"imgLength":null,"imgWidth":null},{"title":"'Dexter' Prequel Series Adds James Martinez, Christina Milian, Alex Shimizu and Reno Wilson","description":"\"Dexter\" prequel series, \"Dexter: Original Sin,\" added four new cast members, Showtime Studios announced Wednesday. James Martinez (\"Love Victor\"), Christina Milian (\"Falling Inn Love\"), Alex Shimizu (\"The Blacklist\") and Reno Wilson (\"Mike & Molly\") will star in the 10-episode drama series as members of the Miami Metro Police Department. Martinez is set to play Angel Batista, an up-and-coming homicide detective, while Milian plays Maria...","link":"https://www.msn.com/en-us/tv/news/dexter-prequel-series-adds-james-martinez-christina-milian-alex-shimizu-and-reno-wilson/ar-BB1nG8Hq","publishDate":"2024-06-05T13:00:00Z","guid":"BB1nG8Hq","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nFYUk.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/tv/news/dexter-prequel-series-adds-james-martinez-christina-milian-alex-shimizu-and-reno-wilson/ar-BB1nG8Hq","imgType":null,"imgLength":null,"imgWidth":null},{"title":"The Brits Invade US Newsrooms With a 'Killer Instinct' and Fleet Street Ethics","description":"The crisis in American news media has led to an unexpected result in a very short time: The invasion of executive news suites by British editors, who experts say bring a \"killer instinct\" to news gathering, while notably downgrading the diversity quotient in news leadership. Most recently with the appointment of Will Lewis as the publisher and CEO of the Washington Post -- and his latest restructuring plan, featuring the appointment of Fleet...","link":"https://www.msn.com/en-us/entertainment/news/the-brits-invade-us-newsrooms-with-a-killer-instinct-and-fleet-street-ethics/ar-BB1nG417","publishDate":"2024-06-05T13:00:00Z","guid":"BB1nG417","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nFYUl.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/entertainment/news/the-brits-invade-us-newsrooms-with-a-killer-instinct-and-fleet-street-ethics/ar-BB1nG417","imgType":null,"imgLength":null,"imgWidth":null},{"title":"‘Dexter' Prequel Series Adds Four to Cast as Production Begins","description":"The upcoming “Dexter” prequel series at Paramount+ with Showtime has begun production in Miami, with four new series regulars joining the show. Variety has learned that James Martinez, Christina Milian, Alex Shimizu, and Reno Wilson have all joined the 10-episode prequel, which is titled “Dexter: Original Sin.” They will star alongside previously announced leads Patrick […]","link":"https://www.msn.com/en-us/tv/news/dexter-prequel-series-adds-four-to-cast-as-production-begins/ar-BB1nG4y7","publishDate":"2024-06-05T13:00:00Z","guid":"BB1nG4y7","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nG6Jk.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/tv/news/dexter-prequel-series-adds-four-to-cast-as-production-begins/ar-BB1nG4y7","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Special #1 - Chris Parrish","description":"This episode was recorded 6 May 2014 live and in person at Brent’s office in lovely, sunny Ballard. You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) Chris has worked at Adobe and as a founder of Rogue Sheep, which won an Apple Design Award for Postage. Chris’s new company is Aged & Distilled with Guy English — which shipped Napkin, a Mac app for visual collaboration. Chris is also the co-host of The Record. He lives on Bainbridge Island, a quick ferry ride from Seattle. This episode is sponsored by Tagcaster. Tagcaster is not just another podcast client — it solves the age-old problem of linking to specific parts of a podcast. You can make clips — short audio excerpts — and share them and link to them. After all these years, that problem is finally solved. This episode is also sponsored by Igloo. Igloo is an intranet you’ll actually like, with shared calendars, microblogs, file-sharing, social networking, and more. It’s free for up 10 users — give it a try for your company or your team today. This episode is also sponsored by Hover. Hover makes domain name management easy. And it’s a snap to transfer domains from other registrars using their valet service. Get 10% off your first purchase with the promotional code PANIC. As in “Don’t Panic! Use Hover.” Take a look. Things we mention, more or less in order of appearance: Oklahoma Wikipedia The shopping cart Rust Homestead Act Pong Atari 2600 President Carter Pinochle Republicans Democrats Apple II Apple II Reference Manual Floppy Disks Odyssey: The Compleat Adventure Marco Epson MX-80 dot matrix printer Parallel port BASIC Apple II graphics modes LiteBrite Apple II Star Wars game Assembler Text adventure games Paper app Graph paper Merlin assembler Pascal compiler for Apple II Locksmith for Apple II Apple II copy protection Radio Shack ROM chips Tin foil Alligator clips The Complete Graphics System The Incomparable Mike Lee on The Record SATs University of Oklahoma LaserWriter Linotronic image setter The Clampetts The Joads Seattle Las Vegas Belltown Capitol Hill Everett Queen Anne Magnolia Adobe Microsoft Windows X-Wing video game 8086 Assembly language Microsoft DOS Sierra On-Line PowerBook Duo Apple IIGS Think C Sega CD-ROMs Postscript Pagemaker Quark Aldus Pioneer Square 1995 Java Natural Intelligence Roaster IDE Illustrator QA Partner Test-Driven Development InDesign COM Matt Joss Version control 2001 SourceSafe Visual Studio C++ OpenDoc Resource Compiler Sharepoint Azure FrameMaker Rogue Sheep CMYK separation Optical character alignment University of Washington HITLab Gel Electrophoresis Jeff Argast PowerPoint Western blots The Guardian Bush Administration Postage Twitterrific Brad Ellis Lehman Brothers Jake Carter Cocoa Quartz Composer Motion After Effects Kyle Richter Ian Baird IAP Rickenbacker’s The House of Shields John Gruber Dave Wiskus Napkin Guy English Thomas Unterberger C4 United Lemur World Cup Brazil WWDC San Francisco NetNewsWire 1999 Eddy awards","link":"http://therecord.co/2014/05/09/chris_parrish.html","publishDate":"2014-05-09T12:30:00Z","guid":"http://therecord.co/2014/05/09/chris_parrish.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"Where Is Lance Armstrong Now? All About the Former Cyclist's Life After His Doping Scandal","description":"Lance Armstrong won a record seven consecutive Tour de France titles before being stripped of them following doping accusations in 2012","link":"https://www.msn.com/en-us/sports/cycling/where-is-lance-armstrong-now-all-about-the-former-cyclist-s-life-after-his-doping-scandal/ar-BB1nFWDf","publishDate":"2024-06-05T13:00:00Z","guid":"BB1nFWDf","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nG1GV.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/sports/cycling/where-is-lance-armstrong-now-all-about-the-former-cyclist-s-life-after-his-doping-scandal/ar-BB1nFWDf","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Jelly Roll and Wife Bunnie XO Reveal They're Undergoing IVF: 'Our Journey Needed to Be Shared'","description":"The musician and his wife revealed on Tuesday, June 4, that they are planning on expanding their family via in vitro fertilization","link":"https://www.msn.com/en-us/music/celebrity/jelly-roll-and-wife-bunnie-xo-reveal-they-re-undergoing-ivf-our-journey-needed-to-be-shared/ar-BB1nG8w4","publishDate":"2024-06-05T12:46:51Z","guid":"BB1nG8w4","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1dJbgK.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/music/celebrity/jelly-roll-and-wife-bunnie-xo-reveal-they-re-undergoing-ivf-our-journey-needed-to-be-shared/ar-BB1nG8w4","imgType":null,"imgLength":null,"imgWidth":null},{"title":"10 Must-Have Hosting Essentials from Joanna Gaines’ Summer Target Drop — All $25 or Less","description":"Including charcuterie boards, string lights, tablecloths, and more","link":"https://www.msn.com/en-us/lifestyle/shopping/10-must-have-hosting-essentials-from-joanna-gaines-summer-target-drop-all-25-or-less/ar-BB1nG48I","publishDate":"2024-06-05T13:00:00Z","guid":"BB1nG48I","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nG8Ls.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/lifestyle/shopping/10-must-have-hosting-essentials-from-joanna-gaines-summer-target-drop-all-25-or-less/ar-BB1nG48I","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Seattle Before the iPhone #7 - John Chaffee","description":"This episode was recorded 16 May 2013 live and in person at Omni’s lovely offices overlooking Lake Union in Seattle. (Check out the OmniFocus 2 public beta!) You can download the m4a file or subscribe in iTunes. (Or subscribe to the podcast feed.) John Chaffee is a co-founder of BusyMac which makes the awesome BusyCal. John talks about being a Mac developer in the ’90s, what it was like at Now Software, and how he got tired of mobile and came back to the Mac. This episode is sponsored by Squarespace. Easily create beautiful websites via drag-and-drop. Get help any time from their 24/7 technical support. Create responsive websites — ready for phones and tablets — without any extra effort: Squarespace’s designers have already handled it for you. Get 10% off by going to http://squarespace.com/therecord. And, if you want to get under the hood, check out their APIs at developers.squarespace.com. This episode is also sponsored by Microsoft Azure Mobile Services. Mobile Services is a great way to provide backend services — syncing and other things — for your iPhone, iPad, and Mac apps. If you’ve been to the website already, you’ve seen the tutorials where you input code into a browser window. And that’s an easy way to get started. But don’t be fooled: Mobile Services is deep. You can write in JavaScript in your favorite text editor and deploy via Git. Good stuff. Things we mention, in order of appearance (roughly): BusyMac BusyCal Now Software Extensis Farallon SplashData PhoneNet connectors AppleTalk Berkeley Mac Users Group (BMUG) Berkeley, CA QA A/UX Desktop publishing Mac iici SCSI Santa Barbara Mac Store Pagemaker Mac 512 VIP Technologies Atari ST Apple IIgs Lotus 1-2-3 Taxes Mac SE/30 Portland Bay Area San Jose System 7 1991 Now Utilities Dave Riggle Claris MacWrite Filemaker Pro Bento 1990 Macworld Expo Floppy disks iCal Now Up-to-Date Macworld Expo Boston Compuserve Windows Altura Mac2Win Qualcomm Osborne Effect Dotcom Bubble Aldus Fetch Quark MacMall OnOne Software 1999 Adobe InDesign OpenDoc Mac OS X Carbon AppKit NetNewsWire Office Space Getty Images PhotoDisx 2001 Palm PDA Handspring Visor PalmGear Handango SplashPhoto SplashMoney SplashID SplashShopper SplashWallet Windows Mobile Symbian Android SplashBlog Instagram 2006 SixApart Movable Type 2007 Mac App Store BusyCal, LLC Google WWDC RSS Safari/RSS Google (Partly) Shuts Down CalDAV MobileMe SyncServices iCloud Sandboxing JCPenney’s Apple Pulls out of Macworld Twitter AirPlay Apple TV Type A Personality Domain Name System BusySync HotSync iCloud Core Data Syncing iCloud Key/Value Storage ActiveSync ExchangeWebService Blackberry","link":"http://therecord.co/2014/03/28/john_chaffee.html","publishDate":"2014-03-28T18:00:00Z","guid":"http://therecord.co/2014/03/28/john_chaffee.html","image":null,"author":null,"comments":null,"enclosures":null,"imgURL":null,"imgType":null,"imgLength":0,"imgWidth":0},{"title":"The Best New Drinks in Grocery Stores This Year","description":"Raise a glass to these standout sips","link":"https://www.msn.com/en-us/foodanddrink/foodnews/the-best-new-drinks-in-grocery-stores-this-year/ss-BB1nFUgV","publishDate":"2024-06-05T13:00:00Z","guid":"BB1nFUgV","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nFUfF.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/foodanddrink/foodnews/the-best-new-drinks-in-grocery-stores-this-year/ss-BB1nFUgV","imgType":null,"imgLength":null,"imgWidth":null},{"title":"Mandy Moore's Beauty Philosophy Now Is 'Less Is More' — These Products Streamline Her Routine (Exclusive)","description":"Moore is partnering with Eucerin to shed light on its effective skin care and to help the brand encourage people to expect more from its products","link":"https://www.msn.com/en-us/health/other/mandy-moore-s-beauty-philosophy-now-is-less-is-more-these-products-streamline-her-routine-exclusive/ar-BB1nG8f1","publishDate":"2024-06-05T12:45:00Z","guid":"BB1nG8f1","image":"https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1nG16n.img","author":null,"comments":null,"enclosures":null,"imgURL":"https://www.msn.com/en-us/health/other/mandy-moore-s-beauty-philosophy-now-is-less-is-more-these-products-streamline-her-routine-exclusive/ar-BB1nG8f1","imgType":null,"imgLength":null,"imgWidth":null}]